# Shape Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
DuctPressureDropData..::..Shape Property
DuctPressureDropData Class See Also
---
The profile type of the duct.
**Namespace:** Autodesk.Revit.DB.Mechanical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public ConnectorProfileType Shape { get; }
```

Visual Basic
---
```text
Public ReadOnly Property Shape As ConnectorProfileType
	Get
```

Visual C++
---
```text
public:
property ConnectorProfileType Shape {
	ConnectorProfileType get ();
}
```

# See Also
DuctPressureDropData Class
Autodesk.Revit.DB.Mechanical Namespace